ThirdParty-v1912/swak4Foam-latest/Examples/BugCases/flowRateAngledDuctUninitializedStored/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoPimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         10;

// deltaT          0.5;
deltaT          1;

writeControl    adjustableRunTime;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           1;

maxDeltaT       1;

libs (
    "libgroovyStandardBCs.so"
    "libsimpleSwakFunctionObjects.so"
    "libswakFunctionObjects.so"
);

functions {
    // initSwak {
    //     // needed to allow DataEntry to work
    //     type initSwakFunctionObject;
    //     region region0;
    // }


    //Comment out globalMaxPInit and it will not be able
    //to properly process buggy_Maxp
    globalMaxPInit
    {
      type addGlobalVariable ;
      outputControl timeStep ; // required by OpenFOAM
      outputInterval 1; // required by OpenFOAM
      globalName MAXP;
      globalScope myVars;
      valueType scalar;
      value 0;
    }

    buggy_Maxp
    {
        type swakExpression;
        valueType surface;
        verbose true;
        surfaceName normal_Plane_Maxp;
        surface {
            type plane;
            basePoint       (0.0 0.0 0.0);
            normalVector    (1 0 0);
            interpolate true;
        }
        variables (
            "MAXP=(MAXP<p) ? p : MAXP;"
        );
        globalScopes ("myVars"); //so that globalMaxPInit works as intended
//         storedVariables (
//             //this fails, so globalMaxPInit had to be added
//             {
//                 name maxp;
//                 initialValue "0";
//             }
//         );

        expression "MAXP";
        accumulations (
            average
        );
        outputControlMode outputTime;//outputTime is added in 0.2.4 Swak4Foam version
        outputInterval 1;
    }

    always_Maxp
    {
        type swakExpression;
        valueType surface;
        verbose true;
        surfaceName normal_Plane_AMaxp;
        surface {
            type plane;
            basePoint       (0.0 0.0 0.0);
            normalVector    (1 0 0);
            interpolate true;
        }
        variables (
            "AMAXP=(AMAXP<p) ? p : AMAXP;"
        );
        storedVariables (
            //this fails, so globalMaxPInit had to be added
            {
                name "AMAXP";
                initialValue "0";
            }
        );

        expression "AMAXP";
        accumulations (
            average
        );
        outputControlMode timeStep;
        outputInterval 1;
    }
};

// ************************************************************************* //
